{
  "data": [
    {
      "id": 1,
      "slug": "Transforming-AI-Generated-Text-into-Human-Like-Prose",
      "title": "Concrete Structural Repairs",
      "catategry": "Tag1",
      "blogImag": "https://lh3.googleusercontent.com/G19a_D4oREsKzbZ--RAROxaJXliolWD9KViBTonWBcIGhjRHfgcJZK03bpqNQfKz0hUHgwpV7tiif1n1_gXtVUZHTRN3_o8qwSEmwIbj9K6xNXwDV_jFtKBWJS3byA=w599-nu-rw-e365",
      "userImg": "./images/user.png",
      "userName": "Candice Wu",
      "designation": "We provide expert brickwork and concrete repair services to restore strength and safety to your property. Using modern techniques and durable materials, we ensure long-lasting stability and compliance with UK building standards.",
      "date": "Aug 9, 2023",
      "raedTime": "11 min",
      "service1_title": "Home Extensions",
      "service1_img": "../../images/servive_bg1.jpg",
      "service1_desc": "Restoring strength, safety, and value to your property with reliable, professional repair solutions. ",
      "service_detail_sec_1_title1": "Safe Structures ",
      "service_detail_sec_1_title1_spn": "Strong Foundations, ",
      "service_detail_sec_1_title1_desc": "Brick and concrete are the backbone of every building. Over time, natural wear and tear, harsh weather, or ground movement can lead to cracks, weakened walls, or damaged foundations. If left unchecked, these issues can compromise safety and reduce the value of your property. Our team specialises in professional brickwork and concrete repairs that not only fix the visible damage but also strengthen the structure for years to come. From small cracks to major restoration work, we make sure your property remains safe, stable, and built to last.  ",
      "service_detail_sec_1_title1_desc_ul_title": "Why Choose Our Structural Repair Services? ",
      "desc_ul_title_li1": "Experienced team with proven expertise in brick and concrete restoration. ",
      "desc_ul_title_li2": "Long-lasting solutions using high-quality materials and techniques. ",
      "desc_ul_title_li3": "Fully compliant with UK building regulations and safety standards. ",
      "desc_ul_title_li4": " Prevents further deterioration, saving you from costly future repairs. ",
      "desc_ul_title_li5": "Enhances property value while restoring confidence in your building. ",
      "service_detail_sec_2_title1_spn": "Protect Tomorrow ",
      "service_detail_sec_2_title": "  ",
      "service_detail_sec_2_title01": "Repair Today, ",
      "service_detail_sec_2_title_desc": "Cracks in walls or damage to concrete might seem minor at first, but they can quickly turn into expensive structural problems. We take a proactive approach: inspect, diagnose, and repair with precision. Our focus is on giving you peace of mind, knowing that your property is safe, sound, and ready for the future.",
      "sec_3_title01": "Reliable Repairs ",
      "sec_3_title01_desc": "We fix more than the surface. Our repairs address the root cause of the problem. Using trusted techniques, we restore structural integrity so you won’t face the same issues again.",
      "sec_3_title02": "Quality Workmanship ",
      "sec_3_title02_desc": "Every repair is handled with care and attention to detail. Whether it’s brick repointing, crack stitching, or concrete patching, we work to the highest standards.",
      "sec_3_title03": "Peace of Mind",
      "sec_3_title03_desc": " We believe in clear communication and honest advice. From the first inspection to the final finish, you’ll know exactly what’s happening and why no surprises, just dependable service. "
    },
    {
      "id": 2,
      "slug": "Transforming-AI-Generated-Text-into-Human-Like-Prose",
      "title": "General Building ",
      "catategry": "Tag1",
      "blogImag": "https://lh3.googleusercontent.com/BZg8xd8Xdd8lms2sOILTY0WD4wcdFdqm8M5YpDkLZ3516uktmYfO8mTVOGp4iazfhLAdoCYPCyE22Z1m8qfeswCFZdfGgLtRIiQEsncPUQmkeqgdAeqU-Lb-kYHe=w599-nu-rw-e365",
      "userImg": "./images/user.png",
      "userName": "Candice Wu",
      "designation": "Our general building services cover everything from small works to major construction projects. With skilled tradesmen and a commitment to excellence, we deliver reliable, high quality results for both residential and commercial properties. ",
      "date": "Aug 9, 2023",
      "raedTime": "11 min",
      "service1_title": "Home Extensions",
      "service1_img": "https://lh3.googleusercontent.com/BZg8xd8Xdd8lms2sOILTY0WD4wcdFdqm8M5YpDkLZ3516uktmYfO8mTVOGp4iazfhLAdoCYPCyE22Z1m8qfeswCFZdfGgLtRIiQEsncPUQmkeqgdAeqU-Lb-kYHe=w599-nu-rw-e365",
      "service1_desc": "We design and build seamless home extensions that add space, value, and comfort. Whether it's a rear, side, or wrap-around extension, we tailor it to your needs.",
      "service_detail_sec_1_title1": "to Big Projects ",
      "service_detail_sec_1_title1_spn": "From Small Jobs ",
      "service_detail_sec_1_title1_desc": " Every property needs improvements, whether it’s a simple wall repair, a new room, or a complete transformation. That’s where our general building services come in. We cover a wide range of construction needs, brickwork, plastering, roofing, flooring, and more. Our team combines hands-on expertise with quality materials to deliver results that look great and last long. Whether you’re upgrading a home or improving a commercial space, we make sure the work is done right, first time. ",
      "service_detail_sec_1_title1_desc_ul_title": "Why Choose Our General Building Services?",
      "desc_ul_title_li1": "Skilled tradesmen with years of local experience.",
      "desc_ul_title_li2": "Covering all aspects of construction indoors and outdoors. ",
      "desc_ul_title_li3": "Work completed to UK safety and building standards. ",
      "desc_ul_title_li4": "Flexible solutions, from minor repairs to large-scale projects. ",
      "desc_ul_title_li5": "Adds both comfort and long-term value to your property. ",
      "service_detail_sec_2_title1_spn": "Our Expertise",
      "service_detail_sec_2_title": " ",
      "service_detail_sec_2_title01": "Your Vision,  ",
      "sec_3_title01": "Comprehensive Services",
      "sec_3_title01_desc": "From masonry to plastering, roofing to renovations, our team can handle a wide scope of building needs under one roof saving you the hassle of managing multiple contractors. ",
      "sec_3_title02": "Attention to Detail ",
      "sec_3_title02_desc": "It’s the little things that make the biggest difference. We take pride in neat finishes, precise workmanship, and construction that not only works well but looks great.",
      "sec_3_title03": "Trusted Approach",
      "sec_3_title03_desc": "We keep things simple and transparent. Clear quotes, reliable timelines, and open communication mean you always know what’s happening at every stage. "
    },
    {
      "id": 3,
      "slug": "Transforming-AI-Generated-Text-into-Human-Like-Prose",
      "title": "New Builds",
      "service1_desc": "Designing and constructing modern, durable, and energy-efficient spaces built to the highest standards. ",
      "catategry": "Tag1",
      "blogImag": "https://lh3.googleusercontent.com/u6sjv6Q9peBuPkPz_yf0pxouoDi2Mc2QAlb6zDLAwDP4nJxprKkq6jpHV4wKaOl9JDbHF0bsbakjiGQ-wpiK64-q-hw0BmynPNaijME3D8vt4J28NP5__HJ7Ojfj=w599-nu-rw-e365",
      "service1_img": "../../images/basement.jpg",
      "userImg": "./images/user.png",
      "userName": "Candice Wu",
      "designation": "Designing and constructing modern, durable, and energy-efficient spaces built to the highest standards. ",
      "date": "Aug 9, 2023",
      "raedTime": "11 min",
      "service_detail_sec_1_title1": "to Your Dream Home ",
      "service_detail_sec_1_title1_spn": "From a Plot of Land ",
      "service_detail_sec_1_title1_desc": "There’s nothing quite like starting fresh with a brand-new property. Whether it’s a family home, a multi-unit development or a commercial building, we handle every stage from initial design to the final handover. Our approach is simple: combine quality craftsmanship, modern design, and eco-friendly methods to create buildings that are safe, stylish, and built to last. With clear communication and skilled project management, we ensure your new build is delivered on time and without unnecessary stress.",
      "service_detail_sec_1_title1_desc_ul_title": "Why Choose Us for New Builds?",
      "desc_ul_title_li1": "Complete service — design, construction, and project management under one roof. ",
      "desc_ul_title_li2": "Energy-efficient materials and sustainable building practices. ",
      "desc_ul_title_li3": "Homes and commercial spaces built to UK regulations and safety standards. ",
      "desc_ul_title_li4": "Delivered on schedule with transparent costs and updates. ",
      "desc_ul_title_li5": "Adds long-term value and comfort to your property.",
      "service_detail_sec_2_title1_spn": "Building for Today   ",
      "service_detail_sec_2_title": " and Tomorrow ",
      "service_detail_sec_2_title_desc": "We don’t just build for now we build for the future. Every project is designed to be durable, efficient, and modern, ensuring your property remains a valuable investment for years to come. ",
      "sec_3_title01": "Personalised Design",
      "sec_3_title01_desc": " Your vision matters. From layout to finishes, we work closely with you to create a property that feels like home or a commercial space that works for your business.",
      "sec_3_title02": "Quality Craftsmanship",
      "sec_3_title02_desc": "Our skilled builders use only trusted materials and proven techniques. The result? Strong, durable structures with flawless finishes. ",
      "sec_3_title03": "Innovative Solutions ",
      "sec_3_title03_desc": "We bring modern construction methods and eco-friendly solutions to every project, ensuring your build is efficient, sustainable, and future-ready."
    },
    {
      "id": 4,
      "slug": "Transforming-AI-Generated-Text-into-Human-Like-Prose",
      "title": "Fire and Flood Renovation",
      "service1_desc": "Restoring homes and businesses after fire or water damage with care, expertise, and precision.",
      "service1_img": "../../images/design-build.jpg",
      "catategry": "Tag1",
      "blogImag": "https://lh3.googleusercontent.com/6cYrYvLJip-k69UwAY_IFmqcGY5CKoHaUl8Cowt6q9e3Qy0rZxh4xlNqvTxGacTUONpQwBManl9_8wSEt97011rcmX5SgdMEZYcJ1hx9sRWObgMBXoE7-JRif9WB=w599-nu-rw-e365",
      "userImg": "./images/user.png",
      "userName": "Candice Wu",
      "designation": "Our team restores properties affected by fire or flood damage, making them safe, functional, and beautifully renewed. We manage everything from structural repairs to full refurbishments, giving you peace of mind during difficult times.",
      "date": "Aug 9, 2023",
      "raedTime": "11 min",
      "service_detail_sec_1_title1": ". Restore. Rebuild",
      "service_detail_sec_1_title1_spn": "Recover ",
      "service_detail_sec_1_title1_desc": "Dealing with the aftermath of a fire or flood is overwhelming. Beyond the visible damage, there are often hidden structural issues, safety concerns, and the emotional toll of losing a functional space. We specialise in restoring fire and flood-damaged properties back to safe, modern, and fully usable conditions. From urgent structural repairs to complete refurbishments, our team manages everything so you can focus on moving forward.",
      "service_detail_sec_1_title1_desc_ul_title": "Why Choose Our Fire & Flood Renovation Services?",
      "desc_ul_title_li1": "Fast response to minimise further damage",
      "desc_ul_title_li2": "Structural and cosmetic restoration handled by experts",
      "desc_ul_title_li3": "Full compliance with UK safety and building regulations.",
      "desc_ul_title_li4": "Modern, energy-efficient materials used during rebuilding.",
      "desc_ul_title_li5": "Transparent process with updates at every stage.",
      "service_detail_sec_2_title1_spn": "Turning Setbacks  ",
      "service_detail_sec_2_title": " Into New Beginnings ",
      "service_detail_sec_2_title_desc": "Every fire or flood leaves behind challenges, but it also creates an opportunity to rebuild stronger and smarter. We don’t just repair the damage, we create renewed spaces that are safer, more efficient, and designed for the future.",
      "sec_3_title01": "Safety First",
      "sec_3_title01_desc": "We prioritise making your property safe before starting any restoration. From electrical checks to structural inspections, we ensure everything is secure.",
      "sec_3_title02": "Expert Restoration",
      "sec_3_title02_desc": "Our builders and tradesmen have experience in fire and water damage recovery, delivering high-quality results that stand the test of time.",
      "sec_3_title03": "Supportive Service",
      "sec_3_title03_desc": "We understand this process can be stressful. That’s why we keep communication clear and compassionate, guiding you through every step with honesty and care."
    },
    {
      "id": 5,
      "slug": "Transforming-AI-Generated-Text-into-Human-Like-Prose",
      "title": "Extensions & Conversions",
      "service1_desc": "Create more space, improve comfort, and increase the value of your home with professional extension and conversion services.",
      "service1_img": "../../images/com-con.jpg",
      "catategry": "Tag1",
      "blogImag": "https://lh3.googleusercontent.com/HRurPmVlBA9hRYorhiJ4zEK2IhRUm1QvWdebpFgLN3siro5TAnICIjs3IG8hUXN-p6R5eF2LaVdnYtCm6_dIlXnRneEz8gPYYHFIfGH0YMhcj5ts8nw7C0zn3Lql=w599-nu-rw-e365",
      "userImg": "./images/user.png",
      "userName": "Candice Wu",
      "designation": "Create more space, improve comfort, and increase the value of your home with professional extension and conversion services.",
      "date": "Aug 9, 2023",
      "raedTime": "11 min",
      "service_detail_sec_1_title1": " More Possibilities",
      "service_detail_sec_1_title1_spn": "More Room, ",
      "service_detail_sec_1_title1_desc": "Outgrowing your home doesn’t always mean moving. With a well-designed extension or conversion, you can create the extra space you need while staying in the place you love. We specialise in kitchen extensions, loft conversions, garage transformations and multi story additions that blend seamlessly with your existing property. Every project is handled with careful planning, skilled craftsmanship, and a focus on adding long-term value to your home.",
      "service_detail_sec_1_title1_desc_ul_title": "Why Choose Our Extensions & Conversions?",
      "desc_ul_title_li1": "Smart designs that complement your home’s style.",
      "desc_ul_title_li2": "Extra space without the stress of moving house.",
      "desc_ul_title_li3": "Fully compliant with UK planning permissions and building regulations.",
      "desc_ul_title_li4": "Boosts property value and enhances everyday living.",
      "desc_ul_title_li5": "Managed from start to finish with clear communication.",
      "service_detail_sec_2_title1_spn": " Transforming Space",
      "service_detail_sec_2_title": " Into Comfort  ",
      "service_detail_sec_2_title_desc": "Whether it’s an open-plan kitchen, a new bedroom in the loft or converting a garage into ahome office, our work focuses on creating spaces that are both practical and beautiful. We make sure every extension feels like it has always been part of your home.",
      "sec_3_title01": "Seamless Design",
      "sec_3_title01_desc": "We match your extension or conversion to your home’s existing structure and style, ensuring it looks natural and cohesive",
      "sec_3_title02": "Quality Construction",
      "sec_3_title02_desc": "From strong foundations to flawless finishes, we deliver workmanship that guarantees both durability and beauty.",
      "sec_3_title03": "Stress-Free Process",
      "sec_3_title03_desc": "We take care of planning permissions, construction, and final touches, keeping you informed every step of the way."
    },
    {
      "id": 6,
      "slug": "Transforming-AI-Generated-Text-into-Human-Like-Prose",
      "title": "Loft Conversions",
      "service1_desc": " Turn unused attic space into a bright, practical, and comfortable living area that adds both space and value to your home.",
      "service1_img": "../../images/renovate.jpg",
      "catategry": "Tag1",
      "blogImag": "https://lh3.googleusercontent.com/Z-Mm23bYzHeiIYSgmbU2DtDoLyPpU4q_HyJKowa2QFI0IYalr3YcUZvV1fl7T4WEf150-4nQ-XuZmEo1aZtOn_ppZFcnWE3CWBYGbi1IMYNGvf8o7O1kDtHlKQ0qvQ=w599-nu-rw-e365",
      "userImg": "./images/user.png",
      "userName": "Candice Wu",
      "designation": "Transform your space with our renovation and remodeling expertise, bringing fresh life and functionality to your home or business.",
      "date": "Aug 9, 2023",
      "raedTime": "11 min",
      "service_detail_sec_1_title1": "Above You",
      "service_detail_sec_1_title1_spn": "Unlock the Potential   ",
      "service_detail_sec_1_title1_desc": "Why waste valuable space in your home? A loft conversion is one of the smartest ways to create more room without extending your property’s footprint. We specialise in dormer, Velux, and mansard loft conversions that transform dark attics into stylish bedrooms, home offices, or playrooms. With a focus on smart design, safe construction, and flawless finishes, we help you make the most of your home.",
      "service_detail_sec_1_title1_desc_ul_title": "Why Choose Our Loft Conversions?",
      "desc_ul_title_li1": "Extra bedrooms, offices, or studios without moving house.",
      "desc_ul_title_li2": "Natural light and energy-efficient design for comfortable living.",
      "desc_ul_title_li3": "Fully compliant with UK building and safety regulations",
      "desc_ul_title_li4": "Increases property value and market appeal.",
      "desc_ul_title_li5": " Managed from design to completion with minimal disruption.",
      "service_detail_sec_2_title1_spn": "Adding Space,   ",
      "service_detail_sec_2_title": " Enhancing Lifestyle",
      "service_detail_sec_2_title_desc": "A loft conversion isn’t just about square footage it’s about making your home work better for you. We design and build conversions that feel natural, functional and perfectly integrated into your property.",
      "sec_3_title01": "Smart Space Solutions",
      "sec_3_title01_desc": "From storage to living areas, we maximize every inch of your loft with practical and creative layouts.",
      "sec_3_title02": "Expert Craftsmanship",
      "sec_3_title02_desc": "Our team delivers strong structural work, excellent insulation, and top-quality finishes to make your loft both safe and stylish.",
      "sec_3_title03": "End-to-End Service",
      "sec_3_title03_desc": "We handle planning, construction, and final touches keeping the process smooth and stress-free."
    }
  ],
  "project_data": [
    {
      "id": 1,
      "slug": "Transforming-AI-Generated-Text-into-Human-Like-Prose",
      "title": "Double Story Extension & Full House Refurbishment – Holyport, Maidenhead",
      "catategry": "Tag1",
      "blogImag": "https://lh3.googleusercontent.com/G19a_D4oREsKzbZ--RAROxaJXliolWD9KViBTonWBcIGhjRHfgcJZK03bpqNQfKz0hUHgwpV7tiif1n1_gXtVUZHTRN3_o8qwSEmwIbj9K6xNXwDV_jFtKBWJS3byA=w599-nu-rw-e365",
      "userImg": "./images/user.png",
      "userName": "Candice Wu",
      "designation": "A major transformation of a family home with a double-story extension and complete interior refurbishment, creating a modern, spacious and stylish living environment.",
      "date": "Aug 9, 2023",
      "raedTime": "11 min",
      "service1_title": "Home Extensions",
      "service1_img": "../../images/servive_bg1.jpg",
      "service1_desc": "Expand and enhance your living space with our expert addition and extension services, seamlessly integrating new areas into your existing home.",
      "service_detail_sec_1_title1": "you can trust",
      "service_detail_sec_1_title1_spn": "Quality ",
      "service_detail_sec_1_title1_desc": "A home is more than just a building—it’s a way of living. If you're planning to build your dream house, Houseline Construction is here to guide you every step of the way in Southeast. We offer top-quality materials and expert support throughout your project. Our experienced team—including contractors, sub-contractors, and project managers—ensures a smooth journey from start to finish.",
      "service_detail_sec_1_title1_desc_ul_title": "Advantages",
      "desc_ul_title_li1": "Expert guidance from start to finish.",
      "desc_ul_title_li2": "Client-focused communication for tailored solutions.",
      "desc_ul_title_li3": "Professional project management ensuring timely completion.",
      "desc_ul_title_li4": "Accurate budget estimation with no hidden costs.",
      "desc_ul_title_li5": "High-quality materials and skilled labor for durable homes.",
      "service_detail_sec_2_title1_spn": "Home Building",
      "service_detail_sec_2_title": " Services ",
      "service_detail_sec_2_title01": "Custom ",
      "service_detail_sec_2_title_desc": "Our custom home building services encompass every aspect of the construction process, ensuring a seamless and enjoyable experience for our clients. Key features of our services include:",
      "sec_3_title01": "Personalized Design:",
      "sec_3_title01_desc": " We work closely with you to understand your preferences, lifestyle, and design aesthetics, translating your ideas into detailed architectural plans and renderings.",
      "sec_3_title02": "Quality Craftsmanship:",
      "sec_3_title02_desc": "From the foundation to the finishing touches, we uphold the highest standards of craftsmanship and construction, utilizing premium materials and techniques to ensure superior quality and durability.",
      "sec_3_title03": "Innovative Solutions:",
      "sec_3_title03_desc": " Whether it's integrating smart home technology, sustainable features, or unique architectural elements, we offer innovative solutions to enhance the functionality, comfort, and efficiency of your home."
    },
    {
      "id": 2,
      "slug": "Transforming-AI-Generated-Text-into-Human-Like-Prose",
      "title": "Double Story Extension & Refurbishment – Reading",
      "catategry": "Tag1",
      "blogImag": "https://lh3.googleusercontent.com/BZg8xd8Xdd8lms2sOILTY0WD4wcdFdqm8M5YpDkLZ3516uktmYfO8mTVOGp4iazfhLAdoCYPCyE22Z1m8qfeswCFZdfGgLtRIiQEsncPUQmkeqgdAeqU-Lb-kYHe=w599-nu-rw-e365",
      "userImg": "./images/user.png",
      "userName": "Candice Wu",
      "designation": "We extended and modernised this property, adding space, natural light, and contemporary finishes throughout.",
      "date": "Aug 9, 2023",
      "raedTime": "11 min",
      "service1_title": "Home Extensions",
      "service1_img": "../../images/servive_bg1.jpg",
      "service1_desc": "Expand and enhance your living space with our expert addition and extension services, seamlessly integrating new areas into your existing home.",
      "service_detail_sec_1_title1": "you can trust",
      "service_detail_sec_1_title1_spn": "Quality ",
      "service_detail_sec_1_title1_desc": "A home is more than just a building—it’s a way of living. If you're planning to build your dream house, Houseline Construction is here to guide you every step of the way in Southeast. We offer top-quality materials and expert support throughout your project. Our experienced team—including contractors, sub-contractors, and project managers—ensures a smooth journey from start to finish.",
      "service_detail_sec_1_title1_desc_ul_title": "Advantages",
      "desc_ul_title_li1": "Expert guidance from start to finish.",
      "desc_ul_title_li2": "Client-focused communication for tailored solutions.",
      "desc_ul_title_li3": "Professional project management ensuring timely completion.",
      "desc_ul_title_li4": "Accurate budget estimation with no hidden costs.",
      "desc_ul_title_li5": "High-quality materials and skilled labor for durable homes.",
      "service_detail_sec_2_title1_spn": "Home Building",
      "service_detail_sec_2_title": " Services ",
      "service_detail_sec_2_title01": "Custom ",
      "service_detail_sec_2_title_desc": "Our custom home building services encompass every aspect of the construction process, ensuring a seamless and enjoyable experience for our clients. Key features of our services include:",
      "sec_3_title01": "Personalized Design:",
      "sec_3_title01_desc": " We work closely with you to understand your preferences, lifestyle, and design aesthetics, translating your ideas into detailed architectural plans and renderings.",
      "sec_3_title02": "Quality Craftsmanship:",
      "sec_3_title02_desc": "From the foundation to the finishing touches, we uphold the highest standards of craftsmanship and construction, utilizing premium materials and techniques to ensure superior quality and durability.",
      "sec_3_title03": "Innovative Solutions:",
      "sec_3_title03_desc": " Whether it's integrating smart home technology, sustainable features, or unique architectural elements, we offer innovative solutions to enhance the functionality, comfort, and efficiency of your home."
    },
    {
      "id": 3,
      "slug": "Transforming-AI-Generated-Text-into-Human-Like-Prose",
      "title": "New Build Home – Great Missenden",
      "catategry": "Tag1",
      "blogImag": "https://lh3.googleusercontent.com/Z-Mm23bYzHeiIYSgmbU2DtDoLyPpU4q_HyJKowa2QFI0IYalr3YcUZvV1fl7T4WEf150-4nQ-XuZmEo1aZtOn_ppZFcnWE3CWBYGbi1IMYNGvf8o7O1kDtHlKQ0qvQ=w599-nu-rw-e365",
      "userImg": "./images/user.png",
      "userName": "Candice Wu",
      "designation": "From a plot of land to a completed family home, this new build showcases modern design, energy efficiency, and quality construction.",
      "date": "Aug 9, 2023",
      "raedTime": "11 min",
      "service1_title": "Home Extensions",
      "service1_img": "../../images/servive_bg1.jpg",
      "service1_desc": "Transform your space with our renovation and remodeling expertise, bringing fresh life and functionality to your home or business.",
      "service_detail_sec_1_title1": "you can trust",
      "service_detail_sec_1_title1_spn": "Quality ",
      "service_detail_sec_1_title1_desc": "A home is more than just a building—it’s a way of living. If you're planning to build your dream house, Houseline Construction is here to guide you every step of the way in Southeast. We offer top-quality materials and expert support throughout your project. Our experienced team—including contractors, sub-contractors, and project managers—ensures a smooth journey from start to finish.",
      "service_detail_sec_1_title1_desc_ul_title": "Advantages",
      "desc_ul_title_li1": "Expert guidance from start to finish.",
      "desc_ul_title_li2": "Client-focused communication for tailored solutions.",
      "desc_ul_title_li3": "Professional project management ensuring timely completion.",
      "desc_ul_title_li4": "Accurate budget estimation with no hidden costs.",
      "desc_ul_title_li5": "High-quality materials and skilled labor for durable homes.",
      "service_detail_sec_2_title1_spn": "Home Building",
      "service_detail_sec_2_title": " Services ",
      "service_detail_sec_2_title01": "Custom ",
      "service_detail_sec_2_title_desc": "Our custom home building services encompass every aspect of the construction process, ensuring a seamless and enjoyable experience for our clients. Key features of our services include:",
      "sec_3_title01": "Personalized Design:",
      "sec_3_title01_desc": " We work closely with you to understand your preferences, lifestyle, and design aesthetics, translating your ideas into detailed architectural plans and renderings.",
      "sec_3_title02": "Quality Craftsmanship:",
      "sec_3_title02_desc": "From the foundation to the finishing touches, we uphold the highest standards of craftsmanship and construction, utilizing premium materials and techniques to ensure superior quality and durability.",
      "sec_3_title03": "Innovative Solutions:",
      "sec_3_title03_desc": " Whether it's integrating smart home technology, sustainable features, or unique architectural elements, we offer innovative solutions to enhance the functionality, comfort, and efficiency of your home."
    }
  ],
  "project_detail_data": [
    {
      "id": 1,
      "slug": "Transforming-AI-Generated-Text-into-Human-Like-Prose",
      "title": "NEW ",
      "catategry": "Tag1",
      "blogImag": "https://lh3.googleusercontent.com/G19a_D4oREsKzbZ--RAROxaJXliolWD9KViBTonWBcIGhjRHfgcJZK03bpqNQfKz0hUHgwpV7tiif1n1_gXtVUZHTRN3_o8qwSEmwIbj9K6xNXwDV_jFtKBWJS3byA=w599-nu-rw-e365",
      "userImg": "./images/user.png",
      "userName": "Candice Wu",
      "designation": "Specializing in new construction, we tailor each project to meet your specific needs, ensuring a seamless build from groundbreaking to final handover",
      "date": "Aug 9, 2023",
      "raedTime": "11 min",
      "service1_title": "Home Extensions",
      "service1_img": "../../images/servive_bg1.jpg",
      "service1_desc": "Expand and enhance your living space with our expert addition and extension services, seamlessly integrating new areas into your existing home.",
      "service_detail_sec_1_title1": "you can trust",
      "service_detail_sec_1_title1_spn": "Quality ",
      "service_detail_sec_1_title1_desc": "A home is more than just a building—it’s a way of living. If you're planning to build your dream house, Houseline Construction is here to guide you every step of the way in Southeast. We offer top-quality materials and expert support throughout your project. Our experienced team—including contractors, sub-contractors, and project managers—ensures a smooth journey from start to finish.",
      "service_detail_sec_1_title1_desc_ul_title": "Advantages",
      "desc_ul_title_li1": "Expert guidance from start to finish.",
      "desc_ul_title_li2": "Client-focused communication for tailored solutions.",
      "desc_ul_title_li3": "Professional project management ensuring timely completion.",
      "desc_ul_title_li4": "Accurate budget estimation with no hidden costs.",
      "desc_ul_title_li5": "High-quality materials and skilled labor for durable homes."
    }
  ],
  "project__details__data_file": [
    {
      "id": 1,
      "title": "New Builds – Crafting Dream Homes with Precision and Passion",
      "description": "Transforming a traditional family home into a modern, spacious, and stylish living environment.",
      "process_title": "Our Process",
      "projects_banner_image": "https://cdn.pixabay.com/photo/2024/08/16/19/08/architecture-8974490_640.jpg",
      "why_choose_image": "https://cdn.pixabay.com/photo/2015/01/29/03/19/mock-up-615668_640.jpg",
      "service1_img": "https://cdn.pixabay.com/photo/2024/09/18/07/04/ai-generated-9055463_640.jpg",
      "process": [
        {
          "step": "Consultation & Planning",
          "details": "We worked closely with the homeowners to understand their needs and create a detailed plan that included design, structural requirements, and approvals."
        },
        {
          "step": " Construction & Extension Build",
          "details": "The double-story extension was constructed using high-quality brickwork and structural steels, ensuring durability and seamless integration with the original home."
        },
        {
          "step": " Full Refurbishment",
          "details": "The entire house was modernised with new flooring, updated interiors, improved insulation, and upgraded electrics and plumbing."
        },
        {
          "step": "Finishing Touches",
          "details": "Final touches included painting, lighting, and fixtures to achieve a sleek, stylish, and functional living space."
        }
      ],
      "why_choose_title": "Why Choose Connect Eco Builders?",
      "why_choose": [
        "Proven Experience – Specialists in extensions and refurbishments across Maidenhead and West London.",
        "Quality Workmanship – Every detail completed with care and precision.",
        "On-Time, On-Budget – Projects delivered efficiently without hidden costs.",
        "Modern & Eco-Friendly – Using energy-efficient solutions and sustainable practices.",
        "Client-Focused – Clear communication and support from start to finish."
      ],
      "recent_projects_title": "Start Building Your Vision Today",
      "recent_projects_title__desci" : "Your ideas deserve to become reality",
      "projects": [
        {
          "desc": "Whether it’s a new home, an extension or loft conversion, or a complete refurbishment, our team is ready to guide you from the first sketch to the final. build. We combine quality craftsmanship, modern design, and eco-friendly practices to deliver results that last."
        },
        {
          "desc": "We also welcome partnerships with suppliers, architects, and community organisations who share the same commitment to excellence and innovation."
        }
      ]
    },
    {
      "id": 2,
      "title": "Home Extensions – Expanding Spaces with Purpose and Precision",
      "description": "Expanding and modernising a family home to create more living space and a fresh, contemporary style.",
      
      "process_title": "Our Process",
      "projects_banner_image": "https://cdn.pixabay.com/photo/2024/01/09/17/54/ai-generated-8498128_640.jpg",
      "why_choose_image": "https://cdn.pixabay.com/photo/2024/11/10/16/23/construction-engineer-9188149_640.jpg",
      "service1_img": "https://cdn.pixabay.com/photo/2024/02/09/15/20/ai-generated-8563254_640.png",
      "process": [
        {
          "step": "Initial Consultation & Vision",
          "details": "We begin by understanding your goals — whether it's a rear kitchen extension, a loft conversion, or a two-storey addition. Our team listens carefully to your space needs, style preferences, and budget."
        },
        {
          "step": "Design & Planning",
          "details": "We work with experienced architects to design extensions that blend seamlessly with your existing home. We focus on natural light, space optimization, and eco-friendly options to elevate your living environment."
        },
        {
          "step": "Construction & Coordination",
          "details": "Our skilled builders manage every phase of the extension process, ensuring minimal disruption to your daily life. We prioritize quality workmanship, timely delivery, and sustainable materials throughout."
        },
        {
          "step": "Finishing Touches & Completion",
          "details": "From flooring and lighting to fixtures and paint, we finish every detail with precision. A final walkthrough ensures everything aligns with your expectations before we hand the space back to you."
        }
      ],
      "why_choose_title": "Why Choose Connect Eco Builders?",
      "why_choose": [
        "Local Expertise – Trusted builders serving Reading and surrounding areas.",
        "High-Quality Extensions – Strong, safe, and seamlessly integrated builds.",
        "Complete Refurbishment Solutions – From structural upgrades to interior finishes.",
        "On-Time Delivery – Projects completed efficiently without cutting corners.",
        "Eco-Conscious Approach – Incorporating energy-efficient materials and methods."
      ],
      "recent_projects_title": "Recent Home Extension Projects",
      "recent_projects_title__desci" : "Your ideas deserve to become reality.",

      "projects": [
        {
          "desc": "Whether it’s a new home, an extension or loft conversion, or a complete refurbishment, our team is ready to guide you from the first sketch to the final build. We combine quality craftsmanship, modern design, and eco-friendly practices to deliver results that last."
        },
        {
          "desc": "We also welcome partnerships with suppliers, architects, and community organisations who share the same commitment to excellence and innovation."
        }
      ]
    },
    {
      "id": 3,
      "title": "New Build Home – Great Missenden",
      "description": "From empty land to a stunning, energy-efficient family home designed for modern living",
      "process_title": "Our Process",
      "projects_banner_image": "https://cdn.pixabay.com/photo/2024/06/11/17/53/ai-generated-8823752_1280.jpg",
      "why_choose_image": "https://cdn.pixabay.com/photo/2017/08/03/15/08/large-hydraulic-excavator-2576750_640.jpg",
      "service1_img": "https://cdn.pixabay.com/photo/2016/11/21/16/37/loader-1846346_640.jpg",
      "process": [
        {
          "step": "Planning & Design",
          "details": "We worked with the client to design a home that matched their lifestyle, securing planning permission and preparing detailed construction plans."
        },
        {
          "step": "Groundworks & Foundations",
          "details": "The project started with strong, durable foundations, ensuring long-term safety and stability for the new home."
        },
        {
          "step": "Structural Build",
          "details": "The home was constructed with quality brickwork, structural steel, and energy-efficient materials, blending modern design with practical performance."
        },
        {
          "step": "Interiors & Finishing",
          "details": "Final touches included kitchen and bathroom installations, flooring, decorating, and fixtures, delivering a ready-to-live-in family home."
        }
      ],
      "why_choose_title": "Why Choose Connect Eco Builders?",
      "why_choose": [
        "Complete New Build Solutions – From design and planning to construction and finishing.",
        "Eco-Friendly Building – Energy-efficient methods for sustainable living.",
        "Modern & Stylish Homes – Designed for today, built to last.",
        "Reliable Delivery – Projects finished on time and within budget",
        "Client-First Approach – Transparent communication throughout the project."
      ],
      "recent_projects_title": "New Build Home – Great Missenden",
      "projects": [
        {
          "name": "Garden Makeover in Essex",
          "desc": "Complete landscape redesign with raised flower beds, a new patio area, and ambient lighting for evening gatherings."
        },
        {
          "name": "Victorian Flat Refurbishment in Bath",
          "desc": "Restored period features, installed hardwood flooring, and refreshed the kitchen and bathroom for modern living."
        },
        {
          "name": "Outdoor Living Space in Oxfordshire",
          "desc": "Created a functional outdoor space with a pergola, seating area, water feature, and native plant garden."
        }
      ]
    }
  ]
}